akobyl/TM4C129_FreeRTOS_Demo/driverlib/inc/hw_lcd.h
//*****************************************************************************
//
// The following are defines for the bit fields in the LCD_O_IM register.
//
//*****************************************************************************
#define LCD_IM_EOF1             0x00000200  // DMA End-of-Frame 1 Interrupt
// Enable Set
#define LCD_IM_EOF0             0x00000100  // DMA End-of-Frame 0 Interrupt
// Enable Set
#define LCD_IM_PALLOAD          0x00000040  // DMA Palette Loaded Interrupt
// Enable Set
#define LCD_IM_FIFOU            0x00000020  // DMA FIFO Underflow Interrupt
// Enable Set
#define LCD_IM_ACBS             0x00000008  // AC Bias Count Interrupt Enable
// Set
#define LCD_IM_SYNCS            0x00000004  // Frame Synchronization Lost
// Interrupt Enable Set
#define LCD_IM_RRASTRDONE       0x00000002  // Raster Mode Frame Done Interrupt
// Enable Set
#define LCD_IM_DONE             0x00000001  // Raster or LIDD Frame Done
// (shared, depends on whether
// Raster or LIDD mode enabled)
// Interrupt Enable Set

//*****************************************************************************
//
// The following are defines for the bit fields in the LCD_O_IENC register.
//
//*****************************************************************************
#define LCD_IENC_EOF1           0x00000200  // DMA End-of-Frame 1 Interrupt
// Enable Clear
#define LCD_IENC_EOF0           0x00000100  // DMA End-of-Frame 0 Interrupt
// Enable Clear
#define LCD_IENC_PALLOAD        0x00000040  // DMA Palette Loaded Interrupt
// Enable Clear
#define LCD_IENC_FIFOU          0x00000020  // DMA FIFO Underflow Interrupt
// Enable Clear
#define LCD_IENC_ACBS           0x00000008  // AC Bias Count Interrupt Enable
// Clear
#define LCD_IENC_SYNCS          0x00000004  // Frame Synchronization Lost
// Interrupt Enable Clear
#define LCD_IENC_RRASTRDONE     0x00000002  // Raster Mode Frame Done Interrupt
// Enable Clear
#define LCD_IENC_DONE           0x00000001  // Raster or LIDD Frame Done
// (shared, depends on whether
// Raster or LIDD mode enabled)
// Interrupt Enable Clear

//*****************************************************************************
//
// The following are defines for the bit fields in the LCD_O_CLKEN register.
//
//*****************************************************************************
#define LCD_CLKEN_DMA           0x00000004  // DMA Clock Enable
#define LCD_CLKEN_LIDD          0x00000002  // LIDD Submodule Clock Enable
#define LCD_CLKEN_CORE          0x00000001  // LCD Core Clock Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the LCD_O_CLKRESET register.
//
//*****************************************************************************
#define LCD_CLKRESET_MAIN       0x00000008  // Software Reset for the entire
// LCD module
#define LCD_CLKRESET_DMA        0x00000004  // Software Reset for the DMA
// submodule
#define LCD_CLKRESET_LIDD       0x00000002  // Software Reset for the LIDD
// submodule (character displays)
#define LCD_CLKRESET_CORE       0x00000001  // Software Reset for the Core,
// which encompasses the Raster
// Active Matrix and Passive Matrix
// logic

#endif // __HW_LCD_H__
